#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-acm.aws_acm_certificate.shunblog_org will be created
  + resource "aws_acm_certificate" "shunblog_org" {
      + arn                       = (known after apply)
      + domain_name               = "shunblog.org"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "*.shunblog.org",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.aws-acm.aws_acm_certificate.shunkakinoki_com will be created
  + resource "aws_acm_certificate" "shunkakinoki_com" {
      + arn                       = (known after apply)
      + domain_name               = "shunkakinoki.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "*.shunkakinoki.com",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.aws-acm.aws_acm_certificate_validation.cert_shunblog_org will be created
  + resource "aws_acm_certificate_validation" "cert_shunblog_org" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-acm.aws_acm_certificate_validation.cert_shunkakinoki_com will be created
  + resource "aws_acm_certificate_validation" "cert_shunkakinoki_com" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-acm.aws_route53_record.cert_validation_shunblog_org must be replaced
-/+ resource "aws_route53_record" "cert_validation_shunblog_org" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_a48e71a8f9a4619202c3e1ff2e59bcb1.shunblog.org" -> (known after apply)
      ~ id              = "Z29GQ4UV60ZIAS__a48e71a8f9a4619202c3e1ff2e59bcb1_CNAME" -> (known after apply)
      ~ name            = "_a48e71a8f9a4619202c3e1ff2e59bcb1" -> (known after apply) # forces replacement
      ~ records         = [
          - "_ba7597dcc259a41649e00686335bb883.hkvuiqjoua.acm-validations.aws.",
        ] -> (known after apply)
      ~ ttl             = 300 -> 60
      ~ type            = "CNAME" -> (known after apply)
        zone_id         = "Z29GQ4UV60ZIAS"
    }

  # module.aws-acm.aws_route53_record.cert_validation_shunkakinoki_com must be replaced
-/+ resource "aws_route53_record" "cert_validation_shunkakinoki_com" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com" -> (known after apply)
      ~ id              = "Z19V0BNFYY29A__7d70e7567830ded68ef35de5b0f509bd_CNAME" -> (known after apply)
      ~ name            = "_7d70e7567830ded68ef35de5b0f509bd" -> (known after apply) # forces replacement
      ~ records         = [
          - "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws.",
        ] -> (known after apply)
      ~ ttl             = 300 -> 60
      ~ type            = "CNAME" -> (known after apply)
        zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.aws_route53_record.shunblog-org-A will be updated in-place
  ~ resource "aws_route53_record" "shunblog-org-A" {
        fqdn    = "shunblog.org"
        id      = "Z29GQ4UV60ZIAS_shunblog.org_A"
        name    = "shunblog.org"
        records = []
        ttl     = 0
        type    = "A"
        zone_id = "Z29GQ4UV60ZIAS"

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d3px2pbdmvukje.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.aws-route-53.aws_route53_record.shunkakinoki-com-A will be created
  + resource "aws_route53_record" "shunkakinoki-com-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunkakinoki.com"
      + type            = "A"
      + zone_id         = "Z19V0BNFYY29A"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.aws-cloudfront.module.aws-acm.aws_acm_certificate_validation.cert_shunblog_org will be created
  + resource "aws_acm_certificate_validation" "cert_shunblog_org" {
      + certificate_arn         = "arn:aws:acm:us-east-1:589845989135:certificate/2a2aa060-7a0b-4c53-af3f-195505b09220"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-cloudfront.module.aws-acm.aws_acm_certificate_validation.cert_shunkakinoki_com will be created
  + resource "aws_acm_certificate_validation" "cert_shunkakinoki_com" {
      + certificate_arn         = "arn:aws:acm:us-east-1:589845989135:certificate/984332ec-fae5-4e46-9d11-db08fcf1efae"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-cloudfront.module.aws-acm.aws_route53_record.cert_validation_shunblog_org will be created
  + resource "aws_route53_record" "cert_validation_shunblog_org" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_a48e71a8f9a4619202c3e1ff2e59bcb1.shunblog.org"
      + records         = [
          + "_ba7597dcc259a41649e00686335bb883.hkvuiqjoua.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z29GQ4UV60ZIAS"
    }

  # module.aws-cloudfront.module.aws-acm.aws_route53_record.cert_validation_shunkakinoki_com will be created
  + resource "aws_route53_record" "cert_validation_shunkakinoki_com" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com"
      + records         = [
          + "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.module.aws_cloudfront.aws_cloudfront_distribution.shunblog_org will be created
  + resource "aws_cloudfront_distribution" "shunblog_org" {
      + active_trusted_signers         = (known after apply)
      + aliases                        = [
          + "shunblog.org",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + smooth_streaming       = false
          + target_origin_id       = "S3-shunblog.org"
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = "shunblog.org.s3.amazonaws.com"
          + origin_id   = "S3-shunblog.org"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.aws-route-53.module.aws_cloudfront.aws_cloudfront_distribution.shunkakinoki_com will be created
  + resource "aws_cloudfront_distribution" "shunkakinoki_com" {
      + active_trusted_signers         = (known after apply)
      + aliases                        = [
          + "shunkakinoki.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + smooth_streaming       = false
          + target_origin_id       = "S3-shunkakinoki.com"
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = "shunkakinoki.com.s3.amazonaws.com"
          + origin_id   = "S3-shunkakinoki.com"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.aws-route-53.module.aws_cloudfront.module.aws-acm.aws_acm_certificate.shunblog_org will be created
  + resource "aws_acm_certificate" "shunblog_org" {
      + arn                       = (known after apply)
      + domain_name               = "shunblog.org"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "*.shunblog.org",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.aws-route-53.module.aws_cloudfront.module.aws-acm.aws_acm_certificate.shunkakinoki_com will be created
  + resource "aws_acm_certificate" "shunkakinoki_com" {
      + arn                       = (known after apply)
      + domain_name               = "shunkakinoki.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "*.shunkakinoki.com",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.aws-route-53.module.aws_cloudfront.module.aws-acm.aws_acm_certificate_validation.cert_shunblog_org will be created
  + resource "aws_acm_certificate_validation" "cert_shunblog_org" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-route-53.module.aws_cloudfront.module.aws-acm.aws_acm_certificate_validation.cert_shunkakinoki_com will be created
  + resource "aws_acm_certificate_validation" "cert_shunkakinoki_com" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-route-53.module.aws_cloudfront.module.aws-acm.aws_route53_record.cert_validation_shunblog_org will be created
  + resource "aws_route53_record" "cert_validation_shunblog_org" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z29GQ4UV60ZIAS"
    }

  # module.aws-route-53.module.aws_cloudfront.module.aws-acm.aws_route53_record.cert_validation_shunkakinoki_com will be created
  + resource "aws_route53_record" "cert_validation_shunkakinoki_com" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z19V0BNFYY29A"
    }

Plan: 19 to add, 1 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
